{"id": "88888888-8888-8888-8888-888888888888", "rule_id": "88888888-8888-8888-8888-888888888888", "name": "WMI Process Call Create", "description": "Detects the use of WMIC to create a new process, a common technique for local or remote execution.", "enabled": true, "severity": "medium", "risk_score": 47, "query": "tags: \"attack.execution\"", "type": "query", "index": ["logstash-security-*"], "tags": ["attack.execution", "attack.t1047"]}
