{"id": "77777777-7777-7777-7777-777777777777", "rule_id": "77777777-7777-7777-7777-777777777777", "name": "Malicious File Download via Bitsadmin", "description": "Detects the use of bitsadmin.exe to download files via the /transfer switch.", "enabled": true, "severity": "medium", "risk_score": 47, "query": "tags: \"attack.command_and_control\"", "type": "query", "index": ["logstash-security-*"], "tags": ["attack.command_and_control", "attack.t1105"]}
