{"id": "33333333-3333-3333-3333-333333333333", "rule_id": "33333333-3333-3333-3333-333333333333", "name": "Clearing Windows Event Logs via Wevtutil", "description": "Detects the use of wevtutil.exe to clear event logs.", "enabled": true, "severity": "high", "risk_score": 50, "query": "tags: \"attack.defense_evasion\"", "type": "query", "index": ["logstash-*"], "tags": ["attack.defense_evasion", "attack.t1070.001"]}
