{"id": "22222222-2222-2222-2222-222222222222", "rule_id": "22222222-2222-2222-2222-222222222222", "name": "LSASS Memory Dump via Comsvcs.dll", "description": "Detects the use of rundll32.exe to execute the MiniDump function of comsvcs.dll to dump LSASS memory.", "enabled": true, "severity": "high", "risk_score": 50, "query": "tags: \"attack.credential_access\"", "type": "query", "index": ["logstash-*"], "tags": ["attack.credential_access", "attack.t1003.001"]}
