{"id": "66666666-6666-6666-6666-666666666666", "rule_id": "66666666-6666-6666-6666-666666666666", "name": "Regsvr32 Execution from Remote Server", "description": "Detects regsvr32.exe attempting to execute a remote script, known as the Squiblydoo bypass.", "enabled": true, "severity": "critical", "risk_score": 99, "query": "tags: \"attack.defense_evasion\"", "type": "query", "index": ["logstash-security-*"], "tags": ["attack.defense_evasion", "attack.t1218.010"]}
