{"id": "44444444-4444-4444-4444-444444444444", "rule_id": "44444444-4444-4444-4444-444444444444", "name": "Scheduled Task Creation via Schtasks", "description": "Detects the creation of a new scheduled task using schtasks.exe.", "enabled": true, "severity": "low", "risk_score": 21, "query": "tags: \"attack.execution\"", "type": "query", "index": ["logstash-security-*"], "tags": ["attack.execution", "attack.persistence", "attack.t1053.005"]}
