{"id": "99999999-9999-9999-9999-999999999999", "rule_id": "99999999-9999-9999-9999-999999999999", "name": "Local User Account Creation via Net.exe", "description": "Detects the creation of a local user account using the net user command.", "enabled": true, "severity": "medium", "risk_score": 21, "query": "tags: \"attack.persistence\"", "type": "query", "index": ["logstash-*"], "tags": ["attack.persistence", "attack.t1136.001"]}
