title: LSASS Memory Dump via Comsvcs.dll
id: 22222222-2222-2222-2222-222222222222
status: experimental
description: Detects the use of rundll32.exe to execute the MiniDump function of comsvcs.dll to dump LSASS memory.
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\rundll32.exe'
        CommandLine|contains|all:
            - 'comsvcs.dll'
            - 'MiniDump'
    condition: selection
falsepositives:
    - Rare legitimate debugging operations.
level: high
tags:
    - attack.credential_access
    - attack.t1003.001
    - nist.800-53.si_4
    - cis.8
    - nist.csf.de.ae
