title: Clearing Windows Event Logs via Wevtutil
id: 33333333-3333-3333-3333-333333333333
status: experimental
description: Detects the use of wevtutil.exe to clear event logs.
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\wevtutil.exe'
        CommandLine|contains:
            - ' cl '
            - ' clear-log '
    condition: selection
falsepositives:
    - IT admin cleanup scripts.
level: high
tags:
    - attack.defense_evasion
    - attack.t1070.001
    - nist.800-53.si_4
    - cis.8
    - nist.csf.de.ae
